mysql> USE `shop`;
Database changed


mysql> SELECT *
    -> FROM `products`;
+----+-------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------+----------+------------+---------------------+---------------------+
| id | name                    | description                                                                                                                                         | price    | catalog_id | created_at          | updated_at          |
+----+-------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------+----------+------------+---------------------+---------------------+
|  1 | Intel Core i3-8100      | Процессор для настольных персональных компьютеров, основанных на платформе Intel.                                                                   |  7890.00 |          1 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  2 | Intel Core i5-7400      | Процессор для настольных персональных компьютеров, основанных на платформе Intel.                                                                   | 12700.00 |          1 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  3 | AMD FX-8320E            | Процессор для настольных персональных компьютеров, основанных на платформе AMD.                                                                     |  4780.00 |          1 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  4 | AMD FX-8320             | Процессор для настольных персональных компьютеров, основанных на платформе AMD.                                                                     |  7120.00 |          1 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  5 | ASUS ROG MAXIMUS X HERO | Материнская плата ASUS ROG MAXIMUS X HERO, Z370, Socket 1151-V2, DDR4, ATX                                                                          | 19310.00 |          2 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  6 | Gigabyte H310M S2H      | Материнская плата Gigabyte H310M S2H, H310, Socket 1151-V2, DDR4, mATX                                                                              |  4790.00 |          2 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
|  7 | MSI B250M GAMING PRO    | Материнская плата MSI B250M GAMING PRO, B250, Socket 1151, DDR4, mATX                                                                               |  5060.00 |          2 | 2021-08-09 14:40:33 | 2021-08-09 14:40:33 |
+----+-------------------------+-----------------------------------------------------------------------------------------------------------------------------------------------------+----------+------------+---------------------+---------------------+
7 rows in set (0,00 sec)


mysql> SELECT *
    -> FROM `catalogs`;
+----+-------------------------------------+
| id | name                                |
+----+-------------------------------------+
|  1 | Процессоры                          |
|  2 | Материнские платы                   |
|  3 | Видеокарты                          |
|  4 | Жесткие диски                       |
|  5 | Оперативная память                  |
+----+-------------------------------------+
5 rows in set (0,00 sec)


mysql> CREATE OR REPLACE VIEW `show_products` AS
    -> SELECT `p`.`id` as `id`, `p`.`name` AS product_name, `c`.`name` as `catalog_name`
    -> FROM `products` AS `p`
    ->          JOIN catalogs AS `c` ON `p`.`catalog_id` = `c`.`id`;
Query OK, 0 rows affected (0,00 sec)


mysql> SELECT *
    -> FROM show_products;
+----+-------------------------+-----------------------------------+
| id | product_name            | catalog_name                      |
+----+-------------------------+-----------------------------------+
|  1 | Intel Core i3-8100      | Процессоры                        |
|  2 | Intel Core i5-7400      | Процессоры                        |
|  3 | AMD FX-8320E            | Процессоры                        |
|  4 | AMD FX-8320             | Процессоры                        |
|  5 | ASUS ROG MAXIMUS X HERO | Материнские платы                 |
|  6 | Gigabyte H310M S2H      | Материнские платы                 |
|  7 | MSI B250M GAMING PRO    | Материнские платы                 |
+----+-------------------------+-----------------------------------+
7 rows in set (0,01 sec)


mysql> SELECT *
    -> FROM show_products
    -> WHERE id = 1;
+----+--------------------+----------------------+
| id | product_name       | catalog_name         |
+----+--------------------+----------------------+
|  1 | Intel Core i3-8100 | Процессоры           |
+----+--------------------+----------------------+
1 row in set (0,00 sec)